import os

import whisper
import torch
import time  # Import the time module

from config import AUDIOS_FOLDER

prompt = """
        Ти асистент, який проводить семантичний аналіз діалогу за такими крітериями:
-	Чіткість та зрозумілість висловленої думки (оцінка від 0 до 10, якщо не 10 - чому)
-	Повнота (чи надалась уся необхідна інформація) (так або ні, якщо ні - чому)
-	Зрозумілість (наскільки легко зрозуміти вміст діалогу) (оцінка від 0 до 10, якщо не 10 - чому)
-	На скільки ефективне та швидке було вирішення проблеми (оцінка від 0 до 10, якщо не 10 - чому)
-	Активне слухання з боку оператора (оцінка від 0 до 10, якщо не 10 - чому)
-	Аналіз настрою оператора та абонента (оцінка від 0 до 10 для кожного, якщо не 10 - чому)
-	Перевірка чи сказав оператор необхідну інформацію. Обов' язково: привітання, спитати чи потрібна ще допомога, прощання.(Так чи ні, якщо не сказав щось, написати що саме)
-	Короткий опис діалогу та його результат
-	Слова паразити оператора (перелік. Не включати сюди смайли)
-	Помилки оператора (перелік)
-	Класифікація: фінанси, обслуговування, відключення, ремонт, ПА - Повторна активація (перепідключення), підключення (обрати щось з цього)
-   Загальний рейтинг оператора (оцінка від 0 до 10)

Тобі надаватиметься діалог, ти маєш за цими параметрами провести аналіз та надати звіт Українською. Кожний пункт відокремити "-" напочатку строки, щоб краще читалося

Також необхідно, щоб ти зібрав усі оцінки (Загальний рейтинг оператора, Чіткість та зрозумілість висловленої думки оператора, Повнота оператора, Зрозумілість оператора, На скільки ефективне та швидке було вирішення проблеми, Активне слухання з боку оператора, Аналіз настрою оператора, чи сказав оператор необхідну інформацію, Слова паразити оператора (відокремити []), класифікація). Для цього напиши останнім рядком "--" потім наступним рядком через кому повтори оцінки у такому порядку як я задав. Не забудь додати перелік слів паразитів та відокремити квадратними дужками список цих слів.
Наприклад (тільки у такій послідовності):
--10, 8, Так, 7, 7, 8, 7, Так, ["тоді", "якщо", "там", "для цього", "то"], обслуговування
        """


def audios():
    dialogs = 1
    for item in os.listdir(AUDIOS_FOLDER):
        torch.cuda.is_available()
        DEVICE = "cuda" if torch.cuda.is_available() else "cpu"

        model = whisper.load_model("medium", device=DEVICE)
        start_time = time.time()

        result = model.transcribe(f"audios/{item}", language="uk", fp16=False,
                                  prompt="Розбий цей діалог на репліки, це аудіо стеріо, тому можна відокремити хто де каже. Розмовляє абонент з оператором кол-центру. Зроби максимально якісну транскрибацію діалогу")

        end_time = time.time()

        result_text = result["text"].replace(" Ширга на українській мові ", "")

        elapsed_time = end_time - start_time
        print(f"Transcription Time: {elapsed_time} seconds")
        from api import call_to_gpt

        result = call_to_gpt(result_text)

        with open('result_audios.txt', 'a', encoding='utf-8') as file:
            file.write("<========================================>\n")
            file.write(f"Dialog {dialogs}\n")
            file.write(f"{result_text}\n")
            file.write(f"Analyze: \n")
            file.write(f"{result[0].message.content.split('--')[0]}\n")
            file.write("<========================================>\n")

        dialogs += 1


if __name__ == '__main__':
    audios()
